{
    "posts": [
        {
            "id": 0,
            "type": "Events",
            "date-start": "2023-02-25",
            "date-end": "2023-03-04",
            "date-created": "2023-05-15",
            "title": "Info Challenge 2023",
            "alt": "Info Challenge 2023 by College of Information Studies @ University of Maryland, College Park - STAMP Center",
            "thumbnail": "images/Info_Challenge2023/Info_Challenge.jpg",
            "caption": "An event hosted for the Information Science majors (at the University of Maryland, College Park) which included a multitude of campuses such as Montgomery College, University of Maryland - Baltimore County, and the United States Naval Academy (USNA). This event hosted a number of Data Analytical, Cybersecurity, and UI/UX Design challenges. Info Challenge 2023 is sponsored by Ernest and Young (EY) and the United States Naval Academy (USNA).",
            "table-of-contents": {},
            "description": [
                "Starting off, this is prompt 1 of what happened at the event.",
                "This is prompt 2 of what happened at the event.",
                "Lastly, this is prompt 3"
            ],
            "images": [

            ],
            "links": {}
        },
        {
            "id": 1,
            "type": "Events",
            "date-start": "2023-03-31",
            "date-end": "2023-04-01",
            "date-created": "2023-05-19",
            "title": "Makeathon 2023",
            "alt": "Makeathon 2023 by UXTerps @ University of Maryland, College Park - Hornbake Library",
            "thumbnail": "images/Makeathon2023/UXTerp_Makeathon.jpg",
            "caption": "An event hosted for the Design and Information majors to work under three different UI/UX challenges. These challenges were sponsored by Communicate Health, College of Information Studies, University of Maryland - Department of Computer Science, Iribe Initiative for Inclusion & Diversity in Computing, SEE (Student Entertainment Events), and Pepsi.",
            "table-of-contents": {},
            "description": [
                "Starting off, this is prompt 1 of what happened at the event.",
                "This is prompt 2 of what happened at the event.",
                "Lastly, this is prompt 3"
            ],
            "images": [
                
            ],
            "links": {}
        },
        {
            "id": 2,
            "type": "Events",
            "date-start": "2023-04-07",
            "date-end": "2023-04-09",
            "date-created": "2023-05-19",
            "title": "BitCamp 2023",
            "alt": "BitCamp 2023 by University of Maryland, College Park - Xfinity Center",
            "thumbnail": "images/BitCamp2023/BitCamp.jpg",
            "caption": "An event hosted for candidates who are interested in coding. Bitcamp is an event where students compete, have fun, and find opportunities!",
            "table-of-contents": {},
            "description": [
                "Starting off, this is prompt 1 of what happened at the event.",
                "This is prompt 2 of what happened at the event.",
                "Lastly, this is prompt 3"
            ],
            "images": [
                
            ],
            "links": {}
        }
    ],
    "portfolio": [
        {
            "id": 0,
            "topic": "Data Analytics",
            "code-language": [
                "Python",
                "R",
                "Tableau",
                "Powerpoint"
            ],
            "date-start": "2023-02-25",
            "date-end": "2023-03-04",
            "date-created": "2023-05-21",
            "name": "Washington Data Crash Files",
            "alt": "Data Analytics Level 4 Challenge for the Info Challenge 2023 @ University of Maryland, College Park",
            "caption": "In this project, we took a look at crash data from Washington State and analyzed traffic patterns that occur throughout the entire state. Using Python to reverse geocode this information, we began formulating solutions to this potential problem (that is, minimizing crash throughout the state).",
            "links": [
                "https://github.com/jnguye79/IC2023"
            ],
            "table-of-contents": {},
            "gallery": [
                "images/Info_Challenge2023/L4/Washington_Crash.jpg",
                "images/Info_Challenge2023/L4/L4_Data_Clean.png",
                "images/Info_Challenge2023/L4/L4_Reverse_Geocode.png",
                "images/Info_Challenge2023/L4/L4_Data_Analysis_1.png",
                "images/Info_Challenge2023/L4/L4_Data_Analysis_2.png"

            ],
            "section-headers": [
                "A State Promise",
                "Taking On New Skills - Geocoding",
                "Critical Analysis",
                "Further Analysis"
            ],
            "content-0": [
                "The Washington Traffic Safety Commission (WTSC) is Washington’s designated State Highway Safety Office and with a numbers of partners, believes in the vision of '<a href='http://wtsc.wa.gov/wp-content/uploads/dlm_uploads/2022/11/WTSC_TZAP_FINAL_Nov-2022.pdf'>Target Zero</a>' and a future when there are no traffic fatalities or serious injuries on Washington roadways. Since the COVID-19 pandemic began in Spring 2020, Washington has experienced an unprecedented year-over-year increase in traffic fatalities.", 
                "The WTSC manages traffic safety behavior programs which include heavy investments in media and outreach. Many of these efforts are intended for a statewide audience, and WTSC also support numerous local media and community outreach efforts.",
                "In this challenge, we will analyze Washington's traffic data geographically as well as logistically. We will address required deliverables and theoretically come up with solutions based on our data analysis."
            ],
            "content-1": [
                
            ],
            "content-2": [

            ],
            "content-3": [

            ],
            "content-4": [

            ],
            "content-5": [

            ]
        },
        {
            "id": 1,
            "topic": "UI/UX",
            "code-language": [
                "Figma",
                "Powerpoint"
            ],
            "date-start": "2023-02-25",
            "date-end": "2023-03-04",
            "date-created": "2023-05-21",
            "name": "iSchool Design Challenge",
            "alt": "One of three challenges from Makeathon 2023 Event @ University of Maryland, College Park",
            "caption": "With the large number of student admissions into the College of Information Studies, it is essential that the website is maintained to have easy access to the many questions that Information Science students need. To do this, we address a few pain points when navigating the site and reworked components to build for easier usage for students.",
            "links": [
                "https://github.com/jnguye79/Makeathon2023",
                "https://jnguye79.github.io/jnguye79/posts.html?id=1"
            ],
            "table-of-contents": {},
            "gallery": [
                "images/Makeathon2023/iSchool_Design.jpg",
                "images/Makeathon2023/iSchool_Portfolio_Cover.jpg",
                "images/Makeathon2023/iSchool_The_Pain_Point.jpg",
                "images/Makeathon2023/iSchool_Thought_Process.jpg",
                "images/Makeathon2023/iSchool_Final_Product.jpg"
            ],
            "section-headers": [
                "The Pain Point",
                "Through the Lense of an Info Science Student",
                "Resulting Factor",
                "Future Considerations + Lessons Learned"
            ],
            "content-0": [
                "With the large number of student admissions into the College of Information Studies, it is essential that the website is maintained to have easy access to the many questions that Information Science students need. To do this, we address a few pain points when navigating the site and reworked components to build for easier usage for students.",
                "Starting off, we need to identify these pain points.", 
                "As addressed by the College of Information Studies, we could look into certain pain points of the website. More specifically, we can find locations on the website where information does not flow smoothly into other clusters of information that might be important. Networking is also a broad term where the department wants to resolve as well.",
                "In this project, we will develop more options on how to address a certain pain point, as well as how to navigate situations of networking in the online space."
            ],
            "content-1": [
                "As an Information Science student, it is important that the information required is purposefully clustered well together to handle multiple questions that might arise from one question.",
                "First off, we decided to brainstorm from a student's perspective. We realized that there are about three major goals for a student at the College of Information Studies: Complete Major, Obtain a Job Role, and Search for Community.",
                "For the 'Complete Major' goal, we realized that the department does an amazing job at handling how to help students hit their goal mark through the usage of counseling sessions. For the second goal (Obtain a Job Role), we asked the question of 'What type of job roles can I apply for my major?'.", 
                "Fortunately, the College of Information Studies does have a page which shares a list of job roles that students can look forward to apply to. From there, we introduced the question of 'What stuff should I be doing to be prepared for such role?'.", 
                "We realized that this pain point has not been addressed for a student in or planning to enter the College of Information Studies.", 
                "There was a list of jobs roles that a student in the major can apply to, but what exact skills, courses, events, and clubs should students be taking a look at. As the fastest growing program at the University of Maryland - College Park campus, how can we deliver to students the future jobs that they can see themselves in.", 
                "This is the problem that we plan to solve.", 
                "As for the last goal (Searching for community), we realized there is a page of listed organizations online that is an amazing resource for students. To build onto the current page, we do have a slight input on how to improve the SEO of the page (which we will discuss after this)."

            ],
            "content-2": [
                "The results were exceptional (link to post <a href='http://jnguye79.github.io/jnguye79/posts.html?id=1'>here</a> and on <a href=''>LinkedIn</a>)!", 
                "Our resulting format (as shown below) solved the problems that a newly student admitting into the major might ask. For each major, we specifically identified a number of job roles that pertain to each major. We created a page that addressed the courses that should be taken, the clubs and events that students should look forward to, and the skills that you should/will learn.", 
                "Additionally, there is a sample resume located at the bottom of the page to assist students on formulating their personal resume.", 
                "A number of honorable mentions (<a href='https://www.linkedin.com/in/claudia-aguilar-26313a20a'>Claudia Aguilar</a> and <a href='https://www.linkedin.com/in/omena-a-8b44b51a3/'>Omena Aboagye</a>) for designing the page extremely well and coming up with the idea together."

            ],
            "content-3": [
                "As far as future considerations go, we realized (as well as the judges) that the filter display that we currently have would not be efficient for a student. A drop-down menu with a collection of jobs may be too long and can be a hassle for future users.", 
                "As so, we realized that it was in our best interest to adapt a more acceptable filtering system with keywords and more filtering options in order to scour through the list more quickly.", 
                "From this project, I learned a number of things that I would like to mention.", 
                "For this project, I realized that it was important to start small. The reason to start on small plans because they are much more feasible. This is a strong point that I played on my presentation which you can find out more about <a href='http://jnguye79.github.io/jnguye79/posts.html?id=1'>here!</a>", 
                "Another thing to mention is that it is extremely important to build off of what has already been developed. The College of Information Studies here at University of Maryland already has a running page with a plethora of information organized. It is very important that we build off of previous developments instead of trying to create something completely new.", 
                "With this idea, that was how we came up with most of our design for the page."

            ],
            "content-4": [

            ],
            "content-5": [

            ]
        },
        {
            "id": 2,
            "topic": "Web-Development",
            "code-language": [
                "HTML",
                "CSS",
                "JavaScript",
                "Markdown",
                "Powerpoint"
            ],
            "date-start": "2023-02-25",
            "date-end": "2023-03-04",
            "date-created": "2023-05-21",
            "name": "Pokemon API Database",
            "alt": "Final Project for INST377 (Dynamic Web Applications) @ University of Maryland, College Park",
            "caption": "A number of Pokemon websites share a plethora of information revolving around Pokemons. With large amount of Pokemon data, it can be hard to organize and even harder to navigate for such information. In this project, we handle the problems of searching for a specific pokemon; Using other filters such as type, physical characteristics, and movesets to handle finding a specific Pokemon.",
            "links": [
                "https://github.com/jnguye79/INST377-Final-Project"
            ],
            "table-of-contents": {},
            "gallery": [
                "images/INST377-Final-Project/Pokemon_API.jpg"
            ],
            "section-headers": [
                "Pokemon Filters",
                "What We Did + Results",
                "Future Considerations + Lessons Learned"
            ],
            "content-0": [
                "A number of Pokemon websites share a plethora of information revolving around Pokemons. With large amount of Pokemon data, it can be hard to organize and even harder to navigate for such information.",
                "If you're an avid Pokemon fan, you might know the name of your favorite Pokemon like the back of your hand. What if you were a newcomer, or a fan from way back then? You might not be able to remember at the top of your head that one Pokemon that you went on tons of adventures with.",
                "If you try searching online, you'll be met with tons of encyclopedias such as <a href=''>this</a> or <a href=''>this</a> or even <a href=''>this!</a>. All these websites all do the same thing, organize Pokemon based on their generation!",
                "In this project, we handle the problems of searching for a specific pokemon; Through the usage of other filters such as type, physical characteristics, and movesets to handle finding a specific Pokemon.",
                "So if you remember a pokemon move that you use frequently (or any other characteristics featured on our webpage), you can filter using that attribute to find your Pokemon!"
            ],
            "content-1": [
                "There was a lot to learn from this project (many thanks to <a href='https://ischool.umd.edu/directory/alex-leitch/'>Professor Leitch</a>).",
                "Starting off, there was a ton of new introductory JavaScript concepts that I had to learn to implement such as 'async/await', 'promises', and 'fetch'. I will be sharing some more learning content about these topics at a later time.",
                "From these topics, I continued to learn about API's and begun to take advantage of the localStorage.",
                "A huge thanks to my partner <a href='https://www.linkedin.com/in/anthony-capasso-813551234/'>Anthony Capasso</a> for setting up the localStorage process and the <a href='https://michalsnik.github.io/aos/'>AOS JS Library</a>.",
                "Lastly, the page is mostly comprised of a looping refresher that reloads HTML for each search query. 'Text Inputs' reinjected HTML per each new letter input and 'Category Inputs' reinjected HTML per each category.",
                "As for the results, you can see a screenshot of the image below. Click <a href='https://jnguye79.github.io/INST377-Final-Project/'>here</a> for the page."
            ],
            "content-2": [
                "With this final project for INST377 (Dynamic Web Applications), my partner and I learned numerous topics of JavaScript. It was an incredible experience to learn all of this within a semester under Professor Leitch's guidance.",
                "This project has jumpstarted my desires to build my own portfolio (the current website that you are on!). With this portfolio, I continued to build onto my JavaScript by using JSON data to fill up my page. You can see how it has been progressing <a href=''>right here</a>.",
                "As for further considerations, I realized that the UI/UX was not up to par as expected. If any changes were to be made in the future, I would most likely reference the layouts of the Pokemon websites discussed before."
            ],
            "content-3": [
            
            ],
            "content-4": [

            ],
            "content-5": [

            ]

        },
        {
            "id": 3,
            "topic": "Databases",
            "code-language": [
                "MySQL"
            ],
            "date-start": "2023-02-25",
            "date-end": "2023-03-04",
            "date-created": "2023-05-21",
            "name": "Game Console Database",
            "alt": "Final Project for INST327 (Database Design and Modeling) @ University of Maryland, College Park",
            "caption": "Throughout the years, gaming is revolutionized in a number of ways. A single game can be published for multiple consoles or can be exclusive to build competition. In this project, we work on constructing a small database comprised of a number of old consoles with a number of game titles.",
            "links": [
                "https://github.com/jnguye79/MySQL/tree/main/INST327"
            ],
            "table-of-contents": {},
            "gallery": [
                "images/INST327-Final-Project/Console_ERD.png",
                "images/INST327-Final-Project/INST377_Views_Queries.png"
            ],
            "section-headers": [
                "The Revolution of Consoles",
                "A Small Replicate",
                "Accomplishments + Learning Points"
            ],
            "content-0": [
                "Throughout the years, gaming is revolutionized in a number of ways. We went from small visual bits with their own orchestrated bit music to what is now, 4k visually qualities with majestical orchestrations.",
                "These games that primarily used to be found on a floopy disk slowly began to find themselves running on different consoles. These days, you can find <a href='https://www.xbox.com/en-US'>Xbox</a> and <a href='https://www.playstation.com/en-us/'>Playstation</a> compete for exclusivity towards their consoles by labeling games exclusive for each console.",
                "In this project, we work on constructing a small database comprised of a number of old consoles with a number of game titles. This project simulates only a small portion of what is now an ever-growing genre."
            ],
            "content-1": [
                "Inserting data into an excel sheet can be very mundane and repetitive. The reason why we chose to only replicate a small portion of this extremely large and complex database is to bring our skills to the test.",
                "In this project, my team and I prioritized testing our skill that we learned in class. These concepts are ER (Entity-Relational) diagrams (visual), normalization (organization to reduce redundancy), indexing (search optimizations + joining tables), integrity (primary + foreign keys concepts). I will update this post to talk about these more in the future.",
                "Our team also had the chance to work on views/queries. These views/queries are built to specifically allow a separate visual to different departments and positions within the work environment.", 
                "A great example is that the financial department in a company may only require information pertaining towards a company sales but the retail department may require an inventory database as well as the daily sales to cross-reference and check."
            ],
            "content-2": [
                "There's a <a href='https://github.com/jnguye79/MySQL/blob/main/INST327/Final%20Project/Final%20Project.pdf'>PDF</a> file that our team finalized for this project. I highly recommend anyone interested in the project to take a look at that as it does a great job at concluding our work. Additionally, I want to give a big thanks to <a href='https://www.linkedin.com/in/patrice-j-shumate/'>Patrice Shumate</a> and <a href='https://www.linkedin.com/in/benjamin-zheng-913133211/'>Benjamin Zheng</a> for their amazing contributions to the project. Without them, I wouldn't have been able to fill out the many relation tables that we had.</a>"
            ],
            "content-3": [
                
            ],
            "content-4": [

            ],
            "content-5": [

            ]
        },
        {
            "id": 4,
            "topic": "Web-Development",
            "code-language": [
                "HTML",
                "CSS",
                "JavaScript",
                "Markdown"
            ],
            "date-start": "2023-05-01",
            "date-end": {},
            "date-created": "2023-06-01",
            "name": "Portfolio",
            "alt": "Work Portfolio for Jimmy Nguyen. This is an ongoing project that will be continuously developed upon",
            "caption": "This is a portfolio consisting of the development of the page, as well as the learning experience from each session. In this project, I plan to share tips and tricks on building out your portfolio in the 'Information Tech' field. Hopefully, these contributions will be helpful to those who find it.",
            "links": [
                "https://github.com/jnguye79/jnguye79"
            ],
            "table-of-contents": {},
            "gallery": [
                "images/Portfolio/Portfolio_Cover.png"
            ],
            "section-headers": [
                "Experiencing the Learning Curve",
                "Branching out onto Personal Projects",
                "Academia is Pricey"
            ],
            "content-0": [

            ],
            "content-1": [

            ],
            "content-2": [
                "As I progressed through my academic years, I began to hear more about the debate between public amenities of european countries and America.", 
                "At first, I was shocked. There was free college in other countries? ",
                "--- Talk about colleges becoming for corporate. Education quality hasn't changed, we're still learning the same things but the price got more expensive for it, which doesn't make sense",
                "With the internet at its peak (and continuously growing exponentially), it should be a priority that at least, every upcoming individual growing up should easily have access to learning material easily",
                "I've planned to create a small academic library or guides and tips for the education that I have learned in my years of college. --- Talk about how you hope it will help the world."
            ],
            "content-3": [
                
            ],
            "content-4": [

            ],
            "content-5": [

            ]
        }

    ]
}